# DBeam_Get2DObjAtFs

## Description
Return the most recently created beam object

```pascal
FUNCTION DBeam_Get2DObjAtFs : HANDLE;
```

```python
def vs.DBeam_Get2DObjAtFs():
    return HANDLE
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight